src/InformationRegisters/ОценкиПриемов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОценкиПриемов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Деактивирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрОценки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыОценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОценкиПриемов/Ext/ManagerModule.bsl
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда

#Область СлужебныеПроцедурыИФункции

// Функция, возвращает оценки приема.
//
Функция ПолучитьОценкиПриема(Прием, Клиент = Неопределено) Экспорт
	
	Если Справочники.Уведомления.ИспользоватьОценкиВизитов() = Истина 
		И ЗначениеЗаполнено(Прием) Тогда		
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Прием"     , Прием);
		Запрос.УстановитьПараметр("Контрагент", Клиент);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОценкиПриемов.Контрагент КАК Контрагент,
		|	ОценкиПриемов.Оценка КАК Оценка,
		|	ОценкиПриемов.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.ОценкиПриемов.СрезПоследних(
		|			,
		|			Прием = &Прием
		|				И &Клиент) КАК ОценкиПриемов";  
		
		Если ЗначениеЗаполнено(Клиент) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Клиент", "Контрагент = &Контрагент");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Клиент", "");
		КонецЕсли;
		
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция, возвращает оценки приема.
//
Функция ПолучитьОценкиСотрудниковПриема(Прием, Клиент = Неопределено, Сотрудник = Неопределено, ПараметрОценки = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОценкиПриемов.Период КАК Период,
	|	ОценкиПриемов.Контрагент КАК Контрагент,
	|	ОценкиПриемов.Сотрудник КАК Сотрудник,
	|	ОценкиПриемов.ПараметрОценки КАК ПараметрОценки,
	|	ОценкиПриемов.Оценка КАК Оценка,
	|	ОценкиПриемов.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ОценкиПриемов.СрезПоследних(
	|			,
	|			Прием = &Прием
	|				И ВЫБОР
	|					КОГДА &Контрагент <> НЕОПРЕДЕЛЕНО
	|						ТОГДА Контрагент = &Контрагент
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &Сотрудник <> НЕОПРЕДЕЛЕНО
	|						ТОГДА Сотрудник = &Сотрудник
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ПараметрОценки <> НЕОПРЕДЕЛЕНО
	|						ТОГДА ПараметрОценки = &ПараметрОценки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ОценкиПриемов");  
	
	Запрос.УстановитьПараметр("Прием"         , Прием);
	Запрос.УстановитьПараметр("Контрагент"    , Клиент);
	Запрос.УстановитьПараметр("Сотрудник"     , Сотрудник);
	Запрос.УстановитьПараметр("ПараметрОценки", ПараметрОценки);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Процедура, делает запись в регистр "ОценкиПриемов".
//
Процедура УстановитьОценкиПриемов(Прием, Сотрудник, ПараметрОценки = Неопределено, Знач Оценка, Знач Комментарий = Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.ОценкиВизитов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Контрагент.Значение          = Прием.Контрагент; 	
	НаборЗаписей.Отбор.Контрагент.Использование     = Истина;	
	НаборЗаписей.Отбор.Прием.Значение               = Прием; 	
	НаборЗаписей.Отбор.Прием.Использование          = Истина;
	НаборЗаписей.Отбор.Сотрудник.Значение           = Сотрудник; 	
	НаборЗаписей.Отбор.Сотрудник.Использование	    = Истина;
	
	Если ЗначениеЗаполнено(ПараметрОценки) Тогда
		НаборЗаписей.Отбор.ПараметрОценки.Значение      = ПараметрОценки;
		НаборЗаписей.Отбор.ПараметрОценки.Использование = Истина;
	КонецЕсли;
	
	НоваяЗапись                = НаборЗаписей.Добавить();
	НоваяЗапись.Период         = ТекущаяДата();
	НоваяЗапись.Контрагент     = Прием.Контрагент;
	НоваяЗапись.Прием          = Прием;
	НоваяЗапись.Сотрудник      = Сотрудник;
	НоваяЗапись.Оценка         = Оценка;
	НоваяЗапись.Комментарий    = Комментарий;
	
	Если ЗначениеЗаполнено(ПараметрОценки) Тогда
		НоваяЗапись.ПараметрОценки = ПараметрОценки;
	КонецЕсли;
	
	НаборЗаписей.Записать(Истина);
	
	ДобавитьУведомлениеИнформироватьОбОтрицательнойОценкеВизита(Прием, Оценка);
	ЛичныйКабинет.ОтправитьУведомлениеСотрудникуОбОценке(Прием, Сотрудник, Оценка);
	
КонецПроцедуры

// Процедура - Записать оценку приема
//
// Параметры:
//  ПараметрыОценкиПриема	 - 	 - 
//  ИспользоватьБизнесЛогику - 	 - 
//  ИспользоватьПопытку		 - 	 - 
//
Процедура ЗаписатьОценкуПриема(ПараметрыОценкиПриема, ИспользоватьБизнесЛогику = Ложь, ИспользоватьПопытку = Ложь) Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	Прием 			= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОценкиПриема, "Прием"			, Неопределено);
	Если НЕ ЗначениеЗаполнено(Прием) Тогда
		Возврат;
	КонецЕсли;
	
	Оценка 			= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОценкиПриема, "Оценка"		, Неопределено);
	Если Оценка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контрагент 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОценкиПриема, "Контрагент"	, Неопределено);
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Прием, "Контрагент");
		Если ЗначениеЗаполнено(Контрагент) Тогда
			ПараметрыОценкиПриема.Вставить("Контрагент", Контрагент); 
		Иначе 	
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	Период 			= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОценкиПриема, "Период"		,ТекущаяДатаСеанса());
	ПараметрыОценкиПриема.Вставить("Период", Период); 				
	Сотрудник 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОценкиПриема, "Сотрудник"		, Неопределено);
	
	ПараметрОценки 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОценкиПриема, "ПараметрОценки", Неопределено);
	Если НЕ ЗначениеЗаполнено(ПараметрОценки) Тогда 
		ПараметрОценки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПараметрыОценки.Оценка");
		Если ЗначениеЗаполнено(ПараметрОценки) Тогда 
			ПараметрыОценкиПриема.Вставить("ПараметрОценки", ПараметрОценки); 			
		КонецЕсли;	
	КонецЕсли;	
	
	НаборЗаписейОценкиПриема = СоздатьНаборЗаписей();
	НаборЗаписейОценкиПриема.Отбор.Период.Установить(Период);
	НаборЗаписейОценкиПриема.Отбор.Контрагент.Установить(Контрагент);
	Если ЗначениеЗаполнено(Сотрудник) Тогда 
		НаборЗаписейОценкиПриема.Отбор.Сотрудник.Установить(Сотрудник);
	КонецЕсли;
	НаборЗаписейОценкиПриема.Отбор.Прием.Установить(Прием);
	Если ЗначениеЗаполнено(ПараметрОценки) Тогда 
		НаборЗаписейОценкиПриема.Отбор.ПараметрОценки.Установить(ПараметрОценки);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НаборЗаписейОценкиПриема.Добавить(), ПараметрыОценкиПриема);
	
	Если НЕ ИспользоватьБизнесЛогику Тогда 
		НаборЗаписейОценкиПриема.ОбменДанными.Загрузка = Истина;	
	КонецЕсли;
	Если ИспользоватьПопытку Тогда 
		Попытка
			НаборЗаписейОценкиПриема.Записать();
		Исключение 
			
		КонецПопытки;	
	Иначе 
		НаборЗаписейОценкиПриема.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Функция - Получить оценку приема
//
// Параметры:
//  Прием		 - 	 - 
//  ТолькоОценку - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОценкуПриема(Прием, ТолькоОценку = Истина) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Прием) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Прием", Прием);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОценкиПриемов.Период КАК Период,
	|	ОценкиПриемов.Контрагент КАК Контрагент,
	|	ОценкиПриемов.Сотрудник КАК Сотрудник,
	|	ОценкиПриемов.Прием КАК Прием,
	|	ОценкиПриемов.ПараметрОценки КАК ПараметрОценки,
	|	ОценкиПриемов.Оценка КАК Оценка,
	|	ОценкиПриемов.Комментарий КАК Комментарий,
	|	ОценкиПриемов.Деактивирован КАК Деактивирован
	|ИЗ
	|	РегистрСведений.ОценкиПриемов.СрезПоследних(, Прием = &Прием) КАК ОценкиПриемов";
	
	ВыборкаОценки = Запрос.Выполнить().Выбрать();
	Если ВыборкаОценки.Следующий() Тогда 
		Если ТолькоОценку Тогда 
    		Возврат ВыборкаОценки.Оценка;
		Иначе 
			Возврат ВыборкаОценки;
		КонецЕсли;	
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Процедура - Добавить уведомление информировать об отрицательной оценке визита
//
// Параметры:
//  Визит	 - 	 - 
//  Оценка	 - 	 - 
//
Процедура ДобавитьУведомлениеИнформироватьОбОтрицательнойОценкеВизита(Визит, Оценка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Уведомления.Ссылка КАК Ссылка,
	|	Уведомления.ОтрицательнаяОценка КАК ОтрицательнаяОценка
	|ИЗ
	|	Справочник.Уведомления КАК Уведомления
	|ГДЕ
	|	НЕ Уведомления.ПометкаУдаления
	|	И Уведомления.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыУведомлений.ИнформироватьОбОтрицательнойОценкеВизита)
	|	И Уведомления.КаналыИнформированияСЕ.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Уведомления.КаналыИнформированияСЕ.ЗадачаСотруднику = ИСТИНА");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ОбщегоНазначения.ПолучитьЗначениеРеквизита(Визит, "СтруктурнаяЕдиница"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ОтрицательнаяОценка = Выборка.ОтрицательнаяОценка;
		Если Оценка <> 0 И Оценка < ОтрицательнаяОценка Тогда 
			Контрагент = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Визит, "Контрагент");
			Если НЕ ОбщегоНазначения.ПолучитьЗначениеРеквизита(Контрагент, "РозничныйПокупатель") Тогда
				РегистрыСведений.СтекУведомлений.ДобавитьДвиженияСтекУведомлений(Выборка.Ссылка, Визит, Ложь, Ложь, Истина);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
